; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v2 - type_1 ?v1 - type_2)
 	      (pred_4 ?v3 - object ?v1 - type_2)
	      (pred_1 ?v2 - type_1 ?v7 - type_3)
	      (pred_3 ?v2 - type_1 ?v3 - object ?v7 - type_3))

   (:action op_1
       :parameters  (?v2 - type_1 ?v6 ?v4 - type_2)
       :precondition (and  (pred_2 ?v2 ?v6))
       :effect (and  (pred_2 ?v2 ?v4)
		     (not (pred_2 ?v2 ?v6))))

   (:action op_2
       :parameters (?v2 - type_1 ?v8 - object ?v5 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v5) (pred_2 ?v2 ?v5) (pred_1 ?v2 ?v7))
       :effect (and (pred_3 ?v2 ?v8 ?v7)
		    (not (pred_4 ?v8 ?v5)) 
		    (not (pred_1 ?v2 ?v7))))

   (:action op_3
       :parameters (?v2 - type_1 ?v8 - object ?v5 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_3 ?v2 ?v8 ?v7) (pred_2 ?v2 ?v5))
       :effect (and (pred_4 ?v8 ?v5)
		    (pred_1 ?v2 ?v7)
		    (not (pred_3 ?v2 ?v8 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_11 obj_03 - type_1
obj_12 obj_02 obj_07 obj_05 - type_3
obj_06 obj_08 obj_09 - type_2
obj_01 obj_10 obj_04 - object)
(:init
(pred_2 obj_11 obj_06)
(pred_1 obj_11 obj_12)
(pred_1 obj_11 obj_02)
(pred_2 obj_03 obj_06)
(pred_1 obj_03 obj_07)
(pred_1 obj_03 obj_05)
(pred_4 obj_01 obj_06)
(pred_4 obj_10 obj_08)
(pred_4 obj_04 obj_09)
)
(:goal
(and
(pred_4 obj_01 obj_08)
(pred_4 obj_10 obj_09)
(pred_4 obj_04 obj_09)
)
)

(:constraints
  (always (not (pred_2 obj_11 obj_09)))
)
)

; plan
1. (op_2 obj_11 obj_01 obj_06 obj_02)
   deleted: (pred_4 obj_01 obj_06) (pred_1 obj_11 obj_02)
   added: (pred_3 obj_11 obj_01 obj_02)
   goals met: 1 of 3
2. (op_1 obj_03 obj_06 obj_08)
   deleted: (pred_2 obj_03 obj_06)
   added: (pred_2 obj_03 obj_08)
   goals met: 1 of 3
3. (op_1 obj_11 obj_06 obj_08)
   deleted: (pred_2 obj_11 obj_06)
   added: (pred_2 obj_11 obj_08)
   goals met: 1 of 3
4. (op_2 obj_11 obj_10 obj_08 obj_12)
   deleted: (pred_4 obj_10 obj_08) (pred_1 obj_11 obj_12)
   added: (pred_3 obj_11 obj_10 obj_12)
   goals met: 1 of 3
5. (op_3 obj_11 obj_01 obj_08 obj_02)
   deleted: (pred_3 obj_11 obj_01 obj_02)
   added: (pred_4 obj_01 obj_08) (pred_1 obj_11 obj_02)
   goals met: 2 of 3
6. (op_3 obj_11 obj_10 obj_08 obj_12)
   deleted: (pred_3 obj_11 obj_10 obj_12)
   added: (pred_4 obj_10 obj_08) (pred_1 obj_11 obj_12)
   goals met: 2 of 3
7. (op_2 obj_03 obj_10 obj_08 obj_05)
   deleted: (pred_4 obj_10 obj_08) (pred_1 obj_03 obj_05)
   added: (pred_3 obj_03 obj_10 obj_05)
   goals met: 2 of 3
8. (op_1 obj_03 obj_08 obj_09)
   deleted: (pred_2 obj_03 obj_08)
   added: (pred_2 obj_03 obj_09)
   goals met: 2 of 3
9. (op_3 obj_03 obj_10 obj_09 obj_05)
   deleted: (pred_3 obj_03 obj_10 obj_05)
   added: (pred_4 obj_10 obj_09) (pred_1 obj_03 obj_05)
   goals met: 3 of 3
